// Дана матрица целых чисел размером n*m. Выведите количество седловых точек. (Седловой точкой называется элемент, который 
// является наименьшим в своей строке и наибольшим в своем столбце или, наоборот, наибольшим в своей строке и наименьшим в 
// своем столбце).

// 3 4 - размерность
// 7 1 5 3
// 3 2 6 4 -> 2
// 5 2 8 6


Console.WriteLine("Hello, World!");
